# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

input_list = [2, 3, 4, 5, 6]
res_list = []

for i in range((len(input_list)+1)//2):
    res_list.append(input_list[i] * input_list[len(input_list)-1-i])

print(res_list)

